; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-75)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b11)
    (on-table b11)
    (clear b8)
    (on b8 b2)
    (on b2 b16)
    (on b16 b4)
    (on b4 b17)
    (on b17 b3)
    (on b3 b9)
    (on b9 b1)
    (on b1 b21)
    (on b21 b14)
    (on b14 b7)
    (on b7 b10)
    (on b10 b22)
    (on b22 b13)
    (on b13 b19)
    (on b19 b18)
    (on b18 b6)
    (on b6 b12)
    (on b12 b20)
    (on b20 b5)
    (on-table b5))
 (:goal (and 
(clear b1) (on b1 b15)
))
)

; plan
1. (unstack b8 b2)
   deleted: (on b8 b2) (clear b8) (arm-empty)
   added: (holding b8) (clear b2)
   goals met: 0 of 2
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 2
3. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 0 of 2
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 2
5. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 0 of 2
6. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 2
7. (unstack b4 b17)
   deleted: (on b4 b17) (clear b4) (arm-empty)
   added: (holding b4) (clear b17)
   goals met: 0 of 2
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 2
9. (unstack b17 b3)
   deleted: (on b17 b3) (clear b17) (arm-empty)
   added: (holding b17) (clear b3)
   goals met: 0 of 2
10. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 2
11. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 2
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 2
13. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 1 of 2
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
15. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 0 of 2
16. (stack b1 b15)
   deleted: (clear b15) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b15)
   goals met: 2 of 2
